app/controllers/api/v1/ideas_controller.rb

SELECT "ideas".* FROM "ideas"
---
  def index
    respond_with Idea.all

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @idea = Idea.find_by(id: params[:id])